fio-test/results/raizn_seq_read/64k-psync-3.out
job1: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=45873: Sat Aug 31 18:03:18 2024
  read: IOPS=17.9k, BW=1120MiB/s (1175MB/s)(673GiB/615172msec)
    clat (usec): min=50, max=1260, avg=435.01, stdev=95.57
     lat (usec): min=50, max=1261, avg=435.83, stdev=95.76
    clat percentiles (usec):
     |  1.00th=[  196],  5.00th=[  237], 10.00th=[  314], 20.00th=[  351],
     | 30.00th=[  371], 40.00th=[  420], 50.00th=[  490], 60.00th=[  494],
     | 70.00th=[  502], 80.00th=[  510], 90.00th=[  523], 95.00th=[  537],
     | 99.00th=[  570], 99.50th=[  594], 99.90th=[  693], 99.95th=[  742],
     | 99.99th=[  873]
   bw (  MiB/s): min= 1096, max= 1637, per=100.00%, avg=1126.04, stdev= 4.74, samples=9796
   iops        : min=17536, max=26206, avg=18014.67, stdev=75.84, samples=9796
  lat (usec)   : 100=0.01%, 250=6.71%, 500=57.84%, 750=35.40%, 1000=0.04%
  lat (msec)   : 2=0.01%
  cpu          : usr=3.95%, sys=13.29%, ctx=11028684, majf=0, minf=272
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11028480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1120MiB/s (1175MB/s), 1120MiB/s-1120MiB/s (1175MB/s-1175MB/s), io=673GiB (723GB), run=615172-615172msec

Disk stats (read/write):
    dm-0: ios=11027486/0, merge=0/0, ticks=3831668/0, in_queue=3831668, util=100.00%, aggrios=2205696/0, aggrmerge=0/0, aggrticks=839963/0, aggrin_queue=839964, aggrutil=100.00%
  nvme1n2: ios=2205696/0, merge=0/0, ticks=843293/0, in_queue=843293, util=100.00%
  nvme4n2: ios=2205696/0, merge=0/0, ticks=833626/0, in_queue=833626, util=100.00%
  nvme0n2: ios=2205696/0, merge=0/0, ticks=819037/0, in_queue=819038, util=100.00%
  nvme3n2: ios=2205696/0, merge=0/0, ticks=851125/0, in_queue=851126, util=100.00%
  nvme2n2: ios=2205696/0, merge=0/0, ticks=852736/0, in_queue=852737, util=100.00%